#pragma once

#define AI_SHIELD_DEVICE_TYPE 0xA15EU
#define AI_SHIELD_PROTOCOL_VERSION 0x00010002U
#define AI_SHIELD_ABI_FREEZE_REVISION 2U
#define AI_SHIELD_ABI_SCHEMA_SHA256 "8152bb2807a796ae7f5bd234edfb11624ffb07ac263b2eb69a83b02c97d06a65"
#define AI_SHIELD_IOCTL_GET_STATUS CTL_CODE(AI_SHIELD_DEVICE_TYPE, 0x800U, METHOD_BUFFERED, FILE_READ_ACCESS)
#define AI_SHIELD_IOCTL_SET_POLICY CTL_CODE(AI_SHIELD_DEVICE_TYPE, 0x801U, METHOD_BUFFERED, FILE_WRITE_ACCESS)
#define AI_SHIELD_IOCTL_GET_EVENT CTL_CODE(AI_SHIELD_DEVICE_TYPE, 0x802U, METHOD_BUFFERED, FILE_READ_ACCESS)

#define AI_SHIELD_POLICY_AUDIT 0U
#define AI_SHIELD_POLICY_ENFORCE 1U
#define AI_SHIELD_POLICY_BLOCK_QUARANTINE_EXECUTION 0x00000001U
#define AI_SHIELD_POLICY_BLOCK_USER_TEMP_EXECUTION 0x00000002U
#define AI_SHIELD_POLICY_BLOCK_DOWNLOAD_EXECUTION 0x00000004U
#define AI_SHIELD_POLICY_BLOCK_RISKY_SCRIPT_COMMAND 0x00000008U
#define AI_SHIELD_POLICY_BLOCK_OFFICE_CHILD_PROCESS 0x00000010U
#define AI_SHIELD_POLICY_SYSTEM_NETWORK_GUARD 0x00000020U
#define AI_SHIELD_POLICY_BLOCK_UNSOLICITED_INBOUND 0x00000040U
#define AI_SHIELD_POLICY_BLOCK_BROWSER_NON_WEB 0x00000080U
#define AI_SHIELD_POLICY_ALL_FLAGS 0x000000FFU

#define AI_SHIELD_SENSOR_WFP 1U
#define AI_SHIELD_SENSOR_MINIFILTER 2U
#define AI_SHIELD_SENSOR_PROCESS 3U
#define AI_SHIELD_EVENT_CONNECT 1U
#define AI_SHIELD_EVENT_ACCEPT 2U
#define AI_SHIELD_EVENT_REDIRECT 3U
#define AI_SHIELD_EVENT_FILE_OPEN 4U
#define AI_SHIELD_EVENT_PROCESS_CREATE 5U
#define AI_SHIELD_EVENT_FILE_WRITE 6U
#define AI_SHIELD_EVENT_FILE_RENAME 7U
#define AI_SHIELD_EVENT_IMAGE_SECTION 8U
#define AI_SHIELD_EVENT_IMAGE_LOAD 9U
#define AI_SHIELD_EVENT_HANDLE_FILTER 10U
#define AI_SHIELD_EVENT_FLAG_IPV6 0x00000001U
#define AI_SHIELD_EVENT_FLAG_BLOCKED 0x00000002U
#define AI_SHIELD_EVENT_FLAG_PROVENANCE_EXTERNAL 0x00000004U
#define AI_SHIELD_EVENT_FLAG_RISKY_COMMAND 0x00000008U
#define AI_SHIELD_EVENT_FLAG_OFFICE_CHILD 0x00000010U

#pragma pack(push, 8)

typedef struct _AI_SHIELD_DRIVER_POLICY {
    ULONG Version;
    ULONG Size;
    ULONG Mode;
    ULONG BlockInboundPort;
    ULONG RedirectOutboundPort;
    ULONG ProxyPort;
    ULONG Flags;
    ULONG ExemptProcessId;
} AI_SHIELD_DRIVER_POLICY;

typedef struct _AI_SHIELD_DRIVER_STATUS {
    ULONG Version;
    ULONG Size;
    ULONG Mode;
    ULONG Reserved;
    LONG64 Observed;
    LONG64 Allowed;
    LONG64 Blocked;
    LONG64 Redirected;
    LONG64 DroppedTelemetry;
} AI_SHIELD_DRIVER_STATUS;

typedef struct _AI_SHIELD_DRIVER_EVENT {
    ULONG Version;
    ULONG Size;
    ULONG Sensor;
    ULONG Kind;
    ULONGLONG Sequence;
    ULONGLONG Timestamp100ns;
    ULONGLONG ProcessId;
    ULONGLONG SubjectId;
    ULONG AddressFamily;
    ULONG LocalPort;
    ULONG RemotePort;
    ULONG Decision;
    ULONG Flags;
    ULONG Reserved;
} AI_SHIELD_DRIVER_EVENT;

#pragma pack(pop)

#if defined(__cplusplus)
#define AI_SHIELD_ABI_ASSERT(condition) static_assert(condition)
#else
#define AI_SHIELD_ABI_ASSERT(condition) C_ASSERT(condition)
#endif

AI_SHIELD_ABI_ASSERT(sizeof(AI_SHIELD_DRIVER_POLICY) == 32U);
AI_SHIELD_ABI_ASSERT(FIELD_OFFSET(AI_SHIELD_DRIVER_POLICY, Version) == 0U);
AI_SHIELD_ABI_ASSERT(FIELD_OFFSET(AI_SHIELD_DRIVER_POLICY, Mode) == 8U);
AI_SHIELD_ABI_ASSERT(FIELD_OFFSET(AI_SHIELD_DRIVER_POLICY, ExemptProcessId) == 28U);
AI_SHIELD_ABI_ASSERT(sizeof(AI_SHIELD_DRIVER_STATUS) == 56U);
AI_SHIELD_ABI_ASSERT(FIELD_OFFSET(AI_SHIELD_DRIVER_STATUS, Observed) == 16U);
AI_SHIELD_ABI_ASSERT(FIELD_OFFSET(AI_SHIELD_DRIVER_STATUS, DroppedTelemetry) == 48U);
AI_SHIELD_ABI_ASSERT(sizeof(AI_SHIELD_DRIVER_EVENT) == 72U);
AI_SHIELD_ABI_ASSERT(FIELD_OFFSET(AI_SHIELD_DRIVER_EVENT, Sequence) == 16U);
AI_SHIELD_ABI_ASSERT(FIELD_OFFSET(AI_SHIELD_DRIVER_EVENT, ProcessId) == 32U);
AI_SHIELD_ABI_ASSERT(FIELD_OFFSET(AI_SHIELD_DRIVER_EVENT, AddressFamily) == 48U);
AI_SHIELD_ABI_ASSERT(FIELD_OFFSET(AI_SHIELD_DRIVER_EVENT, Flags) == 64U);
AI_SHIELD_ABI_ASSERT(FIELD_OFFSET(AI_SHIELD_DRIVER_EVENT, Reserved) == 68U);

#undef AI_SHIELD_ABI_ASSERT
